# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
# Low-GD
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]] # 11

  - [9, 1, Conv, [512, 1, 1]] # 12
  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 14
  - [-1, 3, C2f, [512]] # 15

# High-GD
  - [6, 1, Conv, [128, 1, 1]] # 16
  - [[2, 4, -1], 1, SimFusion_3in, [128]] # 17
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]] # 18
  - [-1, 3, C2f, [128]] # 19  head N2

  - [ 6, 1, Conv, [ 256, 1, 1 ] ] # 20
  - [ [ 2, 4, -1 ], 1, SimFusion_3in, [ 256 ] ] # 21
  - [ [ -1, 11 ], 1, InjectionMultiSum_Auto_pool, [ 256, [ 64, 32 ], 1 ] ] # 22
  - [ -1, 3, C2f, [ 256 ] ] # 23  head N3

  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]] # 24
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 25

  - [[19, 16], 1, AdvPoolFusion, []] # 26
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [32, 96], 0]] # 27
  - [-1, 3, C2f, [256]] # 28  head N4

  - [[-1, 12], 1, AdvPoolFusion, []] # 29
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [512, [32, 96], 1]] # 30
  - [-1, 3, C2f, [1024]] # 31    head N5

  - [[19, 23, 28, 31], 1, Detect, [nc]] # 28